[{"Name":"Forager Brood Cookbook [1]","Crafting Repertoire":"Spellproof Pickled Liver","Location":"Acquired from a pest who hands it to you if you interact with him just west of Ruined Forge of Starfall Past along the cliffside [Map Link]NOTE:You can lock yourself out of the Forager Brood Cookbooks if Moore dies during his questline, and will not be able to pick them up anymore."},{"Name":"Forager Brood Cookbook [2]","Crafting Repertoire":"Fireproof Pickled Liver","Location":"Given by a Non-hostile Servant of Rot. From the pond located to the east of the Cliffroad Terminus Site of Grace, exactly all the way south on the map. It may require certain well-timed jumps from Torrent. [See Shadow of the Erdtree Map]"},{"Name":"Forager Brood Cookbook [3]","Crafting Repertoire":"Lightningproof Pickled Liver","Location":"Acquired from a pest who hands it to you if you interact with it at the north-east corner of the forest of lightning rams near the Furnace Golem on the Ellac River. Closest Site of Grace is Cerulean Coast. [Map Link]NOTE:You can lock yourself out of the Forager Brood Cookbooks if Moore dies during his questline, and will not be able to pick them up anymore."},{"Name":"Forager Brood Cookbook [4]","Crafting Repertoire":"Holyproof Pickled Liver","Location":"Acquired by interacting with a pest found north ofChurch of the Crusade. The pest will be found shivering and unresponsive. Use aWarming StoneorSunwarmth Stoneto warm it up, and reload the area by teleporting or logging out. It can now be interacted with and will grant the cookbook. [Map Link]NOTE:You can lock yourself out of the Forager Brood Cookbooks if Moore dies during his questline, and will not be able to pick them up anymore."},{"Name":"Forager Brood Cookbook [5]","Crafting Repertoire":"Opaline Pickled Liver","Location":"Acquired by interacting with the pest found along the right cliff edge in the poisonous swamp north of Moorth ruins. The swamp can be reached by going through the cave with the Miranda flowers and Perfumers. [Map Link]NOTE:You can lock yourself out of the Forager Brood Cookbooks if Moore dies during his questline, and will not be able to pick them up anymore."},{"Name":"Forager Brood Cookbook [6]","Crafting Repertoire":"Well-Pickled Turtle Neck","Location":"Acquired by interacting with the pest found east outside of the Shadow Keep. It can be accessed from the Church District Highroad site of grace and traveling West up the cliff above the tunnel road, then continuing West to the outer wall of the keep. [Map Link]NOTE:You can lock yourself out of the Forager Brood Cookbooks if Moore dies during his questline, and will not be able to pick them up anymore."},{"Name":"Forager Brood Cookbook [7]","Crafting Repertoire":"Spirit RaisinCharming Branch","Location":"Acquired by selecting the option \"Talk to Moore\" when speaking withMoore. Requires having all of the other Forager Brood Cookbooks. [Map Link]NOTE:You can lock yourself out of the Forager Brood Cookbooks if Moore dies during his questline, and will not be able to pick them up anymore."},{"Name":"Igon's Cookbook [1]","Crafting Repertoire":"Dragon Communion GreaseDragon Communion Harpoon","Location":"Can be found on a corpse in the broken tower just before the Grand Altar of Dragon Communion. [See Shadow of the Erdtree Map]"},{"Name":"Igon's Cookbook [2]","Crafting Repertoire":"Dragon Communion Flesh","Location":"Can be found at the edge of a cliff near the Jagged Peak Mountainside site of grace. [See Shadow of the Erdtree Map]"},{"Name":"Finger-Weaver's Cookbook [1]","Crafting Repertoire":"Glinting Nail","Location":"Found at Finger-Weaver's Hovel. Accessible via Finger Ruins of Rhia following the path to the left and heading straight underneath the Grand Altar of Dragon Communion. [See Shadow of the Erdtree Map]"},{"Name":"Finger-Weaver's Cookbook [2]","Crafting Repertoire":"Fingerprint Nostrum","Location":"Found on a corpse before the bell inFinger Ruins of Miyr. Only accessible after progressing Ymir's questline and finding the secret path under the Cathedral. [See Shadow of the Erdtree Map]"},{"Name":"Greater Potentate's Cookbook [1]","Crafting Repertoire":"Hefty Fire Pot","Location":"Scorched Ruins: From the Hefty Cracked Pot, just head right until a set of stairs is on your left. Take them and continue forward to find the cookbook. [See Shadow of the Erdtree Map]"},{"Name":"Greater Potentate's Cookbook [2]","Crafting Repertoire":"Hefty Furnace Pot","Location":"Looted from a body that's inside the Run-Down Traveler's Rest location. [See Shadow of the Erdtree Map]"},{"Name":"Greater Potentate's Cookbook [3]","Crafting Repertoire":"Hefty Oil Pot","Location":"Across the wooden bridge heading west fromFog Rift Fort, just after the first small tower. [See Shadow of the Erdtree Map]"},{"Name":"Greater Potentate's Cookbook [4]","Crafting Repertoire":"Hefty Magic Pot","Location":"East ofCathedral of Manu Metyr. Can be found on a corpse sitting on the ground, surrounded by multiple Marionette Soldiers. [See Shadow of the Erdtree Map]"},{"Name":"Greater Potentate's Cookbook [5]","Crafting Repertoire":"Hefty Lightning Pot","Location":"Found in the forest area, there are two thunder cows in the area. FromProspect Town, just follow the cliff south to find it. [See Shadow of the Erdtree Map]"},{"Name":"Greater Potentate's Cookbook [6]","Crafting Repertoire":"Hefty Red Lightning Pot","Location":"Found on a cliff edge corpse north of the spirit spring used to launch up towards the Foot of the Jagged Peak grace. [See Shadow of the Erdtree Map]"},{"Name":"Greater Potentate's Cookbook [7]","Crafting Repertoire":"Hefty Poison Pot","Location":"Found in the swamp area, on the east side of the area where the Bloodfiends and Messmer soldiers are fighting. A Giant Poison Miranda Sprout and several smaller ones protect it. It allows you to create aHefty Poison Pot. [See Shadow of the Erdtree Map]"},{"Name":"Greater Potentate's Cookbook [8]","Crafting Repertoire":"Hefty Fetid Pot","Location":"Rauh Base: From the Ravine North site of grace, follow the river west to the west-most area near a water-logged cemetery. The orange side of the river will have a large green mound full ofHorn-Strewn Excrement; The Cookbook will be on top of the mound. [Map Link]"},{"Name":"Greater Potentate's Cookbook [9]","Crafting Repertoire":"Hefty Rot Pot","Location":"After getting past the scarlet rot swamp area, head outside and you'll find this item on a corpse near the wall. [See Shadow of the Erdtree Map] [Video Link]"},{"Name":"Greater Potentate's Cookbook [10]","Crafting Repertoire":"Hefty Fly Pot","Location":"The item is looted from a body that is inside a dilapidated building. You can use your mount to jump onto the roof where you'll find a hole that you can jump through. [See Shadow of the Erdtree Map]"},{"Name":"Greater Potentate's Cookbook [11]","Crafting Repertoire":"Hefty Freezing Pot","Location":"Belurat Gaol: Found within the jar labyrinth. [See Shadow of the Erdtree Map] [Video Link]"},{"Name":"Greater Potentate's Cookbook [12]","Crafting Repertoire":"Hefty Rock Pot","Location":"To find the book, descend from the top of the waterfall using the rocks as steps. The book can be looted from a corpse leaning on one of the elevated rocks. [See Shadow of the Erdtree Map]"},{"Name":"Greater Potentate's Cookbook [13]","Crafting Repertoire":"Hefty Volcano Pot","Location":"Ruined Forge Lava Intake. Take the first ladder down, and go up the set of stairs on the right, you will find it on a body near the back wall. This cookbook allows you to craft aHefty Volcano Pot. [See Shadow of the Erdtree Map]"},{"Name":"Greater Potentate's Cookbook [14]","Crafting Repertoire":"Hefty Rancor Pot","Location":"Going through the north-west path from theCharo's Hidden Gravegrace, hug the water to the left until you stumble upon a corpse holding the cookbook, guarded by a large poison Miranda Flower and several smaller Miranda Flowers. [See Shadow of the Erdtree Map]"},{"Name":"Ancient Dragon Knight's Cookbook [1]","Crafting Repertoire":"Red Lightning Pot","Location":"Fog Rift Catacombs. After the room with the sorcerer, the path opens up. Take the right side first, fight the two imps and grab this item from the ground. [See Shadow of the Erdtree Map]"},{"Name":"Ancient Dragon Knight's Cookbook [2]","Crafting Repertoire":"Dragonbolt GreaseDrawstring Dragonbolt Grease","Location":"Found in a chest inScorpion River Catacombs. Right after the room with the annoying elevated sorcerer and two imps, you'll come across a bridge patrolled by more death eyes. You can drop off the side onto a path which eventually leads to the chest for this. [Shadow of the Erdtree Map link] [Video Link]"},{"Name":"Mad Craftsman's Cookbook [1]","Crafting Repertoire":"Frenzied Flame PotRoped Frenzied Flame Pot","Location":"Abyssal Woods: West from the Divided Falls Site of Grace, up the rocks that lead to the waterfall. [Shadow of the Erdtree Map]"},{"Name":"Mad Craftsman's Cookbook [2]","Crafting Repertoire":"Hefty Frenzied Flame Pot","Location":"Abyssal Woods: Found on a corpse among large roots in the upper areas in the middle portion of the map. Access by going west and climbing up. [Elden Ring Map]"},{"Name":"Mad Craftsman's Cookbook [3]","Crafting Repertoire":"Surging Frenzied Flame","Location":"Found in Midra's Manse, just before the second site of grace. Walk across the rafters and jump into a room filled with frenzy rats. The cookbook is found on a body in that room. [See Shadow of the Erdtree Map]"},{"Name":"St. Trina Disciple's Cookbook [1]","Crafting Repertoire":"Eternal Sleep Pot","Location":"Cerulean Coast: From the Cerulean Coast Cross site of grace, head north, across a coffin ship, and while mounted, double jump to the hill with a large, wilted tree being guarded by aCemetery Shade. There will be a sitting corpse under the tree, which holds the Cookbook. [See Shadow of the Erdtree Map]"},{"Name":"St. Trina Disciple's Cookbook [2]","Crafting Repertoire":"Eternal Sleep GreaseDrawstring Eternal Sleep Grease","Location":"From Cerulean Coast Cross follow the path south until the very end to the highest cliff of the mountain. [See Shadow of the Erdtree Map]"},{"Name":"St. Trina Disciple's Cookbook [3]","Crafting Repertoire":"Lulling Branch","Location":"Found in the Garden of Deep Purple after defeating thePutrescent Knight. The cookbook is inside the small cave nearby.  [See Shadow of the Erdtree Map] [Video Link]"},{"Name":"Fire Knight's Cookbook [1]","Crafting Repertoire":"Messmerfire GreaseDrawstring Messmerfire Grease","Location":"East of the Highroad Cross Site of Grace, there is a Messmer soldier encampment. In one of the tents you can find this item. [See Shadow of the Erdtree Map]"},{"Name":"Fire Knight's Cookbook [2]","Crafting Repertoire":"Fire Coil","Location":"In the soldier camp past Ellac Greatbridge, found inside one of the tents. Beware of the black knight in the area. [See Shadow of the Erdtree Map]"},{"Name":"Loyal Knight's Cookbook","Crafting Repertoire":"Royal Magic GreaseDrawstring Royal Magic Grease","Location":"The Loyal Knight's Cookbook can be found inside a chest. The chest is located inside an armory room. [See Shadow of the Erdtree Map]"},{"Name":"Battlefield Priest's Cookbook [1]","Crafting Repertoire":"Golden GreaseDrawstring Golden Grease","Location":"Shadow Keep. Facing the Queen Marika's statue from the front, take the right room and continue towards the stairs, to reach the upper level in which this cookbook can be found. [See Shadow of the Erdtree Map]"},{"Name":"Battlefield Priest's Cookbook [2]","Crafting Repertoire":"Festive Grease","Location":"Fort Reprimand. Take the stairs up after defeating Black Knight Edreed. It is inside the chest at the top. [See Shadow of the Erdtree Map]"},{"Name":"Battlefield Priest's Cookbook [3]","Crafting Repertoire":"Golden Vow","Location":"The item can be looted from a corpse, located inside an army tent. [See Shadow of the Erdtree Map]"},{"Name":"Battlefield Priest's Cookbook [4]","Crafting Repertoire":"Sunwarmth Stone","Location":"Shadow Keep: Take the left lift down from the Storehouse, first floor site of grace. take the first exit to the right and continue forward until the end of the hallway. Kill the enemy, and take the left route, hit the wall to reveal a path. TheBattlefield Priest's Cookbook [4]is on a corpse, after the revealed hidden door. [See Shadow of the Erdtree Map]"},{"Name":"Grave Keeper's Cookbook [1]","Crafting Repertoire":"Piquebone ArrowPiquebone Arrow (Fletched)Piquebone Bolt","Location":"From cerulean coast west, head southeast until you reach a small grave with a tree. There should be a tree on your map not that far from the grace. [See Shadow of the Erdtree Map]"},{"Name":"Grave Keeper's Cookbook [2]","Crafting Repertoire":"Polter Stone","Location":"Located shortly after entering Charo's Hidden Grave. It's by a pile of rocks and turtles when you first reach the water. [See Shadow of the Erdtree Map]"},{"Name":"Antiquity Scholar's Cookbook [1]","Crafting Repertoire":"Fire Spritestone","Location":"North of the temple town ruins site of grace, past the red servants of rot, there is a cave, inside it you will find a shadow pothead enemy. Beware of the poison traps littered around. Drops x3Fire Spritestone, andAntiquity Scholar's Cookbook [1]. [See Shadow of the Erdtree Map]"},{"Name":"Antiquity Scholar's Cookbook [2]","Crafting Repertoire":"Spritestone","Location":"From the entrance of theAncient Ruins of Rauh, head north towards the edge, and head west, you will find an area with an item below in which you can jump. [See Shadow of the Erdtree Map]"},{"Name":"Tibia's Cookbook","Crafting Repertoire":"Call of Tibia","Location":"Dropped by Tibia Mariner upon defeat, located at the entrance of Charo's Hidden Grave. [Map Link]"}]